__author__ = 'midorikawakeita'
import sys
"""
入力例
# ########
# ## ### #
#    ##  #
####    ##
# ## #####
#    #   #
# #### # #
#      # #
## ## ## #
######## #
出力例
#+########
#+##0###0#
#++++##00#
####+000##
#0##+#####
#++++#+++#
#+####+#+#
#++++++#+#
##0##0##+#
########+#
"""
#def my_maze(maze_text):
    #迷路の入力を行列の形式に変換

    #迷路の入力→入力形式は行列（迷路は"#"と" "で構成）
    #" "の部分をすべて+に置換
    #３方向が"#"または" "に囲まれているマスを" "に置換
list=[]
while True:
    i=sys.stdin.readline().rstrip()
    if len(i)==0:
        break
    list.append(i)
print(list)
